Repository: yrbane/nethttp.net-base-plugin
Catalog: languages/default-*.po
Languages: fr_fr

source: Base Plugin Documentation
fr_fr: Documentation du plugin de base

source: Don't show this message again
fr_fr: Ne plus afficher ce message

source: for more information and updates.
fr_fr: pour plus d’informations et de mises à jour.

source: Here is the documentation for the Base Plugin.
fr_fr: Voici la documentation du plugin de base.

source: Plugin deactivated.
fr_fr: Plugin désactivé.

source: Settings
fr_fr: Paramètres

source: Thank you for installing the
fr_fr: Merci d'avoir installé le

source: Thank you for installing the plugin!
fr_fr: Merci d'avoir installé le plugin !

source: The WordPress plugin "BasePlugin" is a foundational class designed to streamline the development of custom plugins for WordPress. It provides an organized structure and essential features for rapidly creating custom extensions. This class simplifies translation management, activation message display, and offers a robust foundation for adding plugin-specific functionality. Developers can extend this class by creating a child class to implement project-specific features, all while benefiting from a well-documented and ready-to-use structure.
fr_fr: Le plugin WordPress "BasePlugin" est une classe de base conçue pour simplifier le développement de plugins personnalisés pour WordPress. Il offre une structure organisée et des fonctionnalités essentielles pour créer rapidement des extensions sur mesure. Cette classe facilite la gestion des traductions, l'affichage de messages d'activation et fournit une base solide pour ajouter des fonctionnalités spécifiques au plugin. Les développeurs peuvent étendre cette classe en créant une classe enfant pour implémenter des fonctionnalités spécifiques à leur projet, tout en bénéficiant d'une structure bien documentée et prête à l'emploi.

source: To configure the plugin settings, please visit the
fr_fr: Pour configurer les paramètres du plugin, veuillez visiter le

source: To use and extend the Base Plugin in your own plugin
fr_fr: Pour utiliser et étendre le plugin de base dans votre propre plugin

source: Visit our
fr_fr: Visitez notre
